{
    "53ed4e2d4b98b1f2": "Last updated October 16, 2020.",
    "891c30bd53d111bd": "We use standard Google Drive sharing functionality when you decide to share the file, and standard Google Drive authentication, authorization mechanisms for access control.\n                No other files than those you create with the tool or decide to open with it (either by opening from Google Drive or visiting its associated URL on the tool) will be accessed, and none will ever be stored.",
    "ca7e162e7ce72b77": "The website offers the possibility to log in with Google Drive to upload and save files in order to facilitate the storage, versioning and sharing of GPX files.\n                That service authenticates you directly with your Google account, and an authentication token identifying you as the file owner is stored in your local browser session profile.\n                This information is used to browse GPX files in your Google Drive and to open only those you choose to open.\n                Furthermore, it is used to automatically authenticate users visiting the website again but it is never stored on our side.",
    "88d5b7d254e5d97": "we have nothing to hide",
    "66bc64ae40e5d08f": "The code of the website is open-source (see",
    "3b081295bed13143": "The files created, visualized or edited on the website are only read once and never stored on a server.\n                We only access the data contained in the files and handle all computations from your local browser (it is a pure client-side application).",
    "507e0a3b2c244f22": "is an online GPX file editor which allows users to create, view and edit files.\n                We respect the privacy of our users and do not collect any personal information except anonymous information such as the number of page views and clicks on buttons to help us enhance your overall experience.",
    "1def89dcf7da5919": "Privacy Policy",
    "df778793a61db41a": "We reserve the right to modify these Terms at any time. By continuing to use the Services after the changes become effective, you agree to the revised Terms.",
    "dd491335cde58142": "Changes to Terms",
    "67f3eadff52f431c": "To the fullest extent permitted by law, in no event shall we be liable for any damages or loss of data, business, profits, computer hardware or software.",
    "a90fe4c69f5e910d": "Limitation of Liability",
    "17ad17809129c62e": "The services on the website are provided \"as is\". To the fullest extend permitted by law, we make no warranties either implied or expressed about the Services. We do not make any promise about the accuracy of specific functions of the services, their reliability or availability.",
    "138e8a4a7d44d02d": "Warranties",
    "a9827a46317115df": "Our Services are offered for free and without advertisement. We solely rely on donations to fund the paying components on which the website relies.",
    "905b43542a4ced29": "Pricing",
    "8b9f34acdce9ab39": "We may change the features of our Services, withdraw or add new features from time to time.",
    "83bf6647e30ad44f": "Changes to the Services",
    "561c3024bb39ff82": "By accessing this website, you are agreeing to be bound by this website Terms of Services and to review our Privacy Policy. If you do not agree with any of these terms, you are prohibited from using or accessing this site.",
    "72ac238425c6d292": "These terms of service (Terms) cover your use and access of our website and related software (our Services).",
    "4924e67c922e128d": "Thank you for using",
    "f295949bad3627ad": "Terms of Services",
    "b491b21c50597823": "is also a good place to report issues or share ideas",
    "1eff94b94be67805": "For developers, the",
    "9d2fb347630e03c8": "or by email at",
    "fb6c3f9d2cc12428": "should answer most questions about the functionalities, but feel free to ask for help, report any issues or send suggestions on the",
    "6c66f5e0f90b5f9b": "dialog and the",
    "52944cf13a757234": "The",
    "2307704c1240a4be": "Preview",
    "9fba760494fbcbac": "HTML code",
    "1d9b514277987faa": "Default map",
    "de0fefd25d69bc28": "Imperial",
    "e67f1920901ddff8": "Running",
    "4cebdf0c3fa85d67": "Google Drive file IDs (separated by commas)",
    "cfb84511232a168c": "File URLs (separated by commas)",
    "302da633aea84cf5": "Parameters",
    "6a5be5add824926": "to show direction markers. Below is a playground to play with the parameters, see a preview and get the HTML code",
    "d5a4dee3b49b8d94": "to show distance markers and",
    "b682eea66a8cc50a": "to display the pace in minutes by unit of distance,",
    "339660669ed27724": "to get data in miles and feet,",
    "893897471a082186": "You can optionally add parameters to the source URL:",
    "50588fe51dc7b3a7": "parameter with a valid",
    "4780e3d635175927": "To use Mapbox maps, you need to specify the",
    "4074aeefadf3c114": "among the following values:",
    "46da7d97b05b3abd": "Choose the map shown by default with the parameter",
    "7b154ba5061f788d": "parameter of the query string and make sure they are available to all users with the link.",
    "a8d2a53acd8fab41": "Just save the files to your Google Drive when exporting and copy the code provided! If you want to display files that you already have on your Google Drive, add the ID of the file in the",
    "c87cf7ddf962c562": "is allowed to request the files, otherwise the requests will be blocked by the",
    "a85c12f7bb2ae3a9": "to encode any special characters and that",
    "2893a62a5e4523f8": "parameter of the query string. Make sure to use",
    "fb8d3dbe0fd5b370": "attribute of the",
    "624cfb1f430449ed": "Add the link to the file in the",
    "3bb6199a2a1223da": "File URL:",
    "714e8d03b8d9efa6": "There are two ways to do it: the first one with files stored on a server and the second one with Google Drive.",
    "f8fb300df6ee2585": "You are very welcome to display traces on your website with",
    "b6286f777c4dc93a": "if you have troubles in other browsers.",
    "61ece99660a99a33": "Get in touch",
    "bb57fad245d8483": "On Edge, disable the following setting: ",
    "dac8dc601214c419": "On Chrome, disable the following setting: ",
    "3b4893a49374f115": "If it does not load correctly:",
    "bdbdf8201ec18a31": "check the box",
    "bd9d90df411ef932": "with your Strava account.",
    "b8a9639db1d34652": "Log in to the",
    "c981b6c1d72ab2a0": "Load the Strava Heatmap",
    "266bf2ac031b509b": "Map legends",
    "4a5a9ec3175917ad": "Show distance markers",
    "fee15f8898ea58e9": "Direction markers",
    "1ad4e50b7e7176ec": "and check the box",
    "ea0592abfdef91a4": "To show direction markers, go in the settings",
    "1b4b65c08553688a": "Show direction markers",
    "ff45eb85f4c3b842": "to select an activity and see the speed or the running pace in minutes per kilometer or mile.",
    "92ed7769ebca578": "and click on",
    "dd223a4a5c9e0392": "To change the units, go in the settings",
    "dc3b7959cdf39ffe": "Change the units",
    "f6e0806008f61516": "and uncheck the box",
    "965632b76a51c062": "To hide the elevation profile, go in the settings",
    "2cd9efa29b7d6734": "Hide the elevation profile",
    "d28b7ab7841a20f5": "and then type an address. Choose one of the suggested locations to center the map on it.",
    "d631f8d5b74f1d10": "Center the map on a location",
    "31ec91ab93a77715": "and then click on the map to open Google Street View at that location.",
    "2054ffe8828383a2": "In the top-right corner, click on",
    "f6afac669671cbcd": "Open Google Street View",
    "6e9826c41d7ee257": "in the top toolbar.",
    "1937b0d3cf0e3f56": "To remove all GPX files at once, click on",
    "7845a4af877511de": "Below the bottom panel, select the tab of the file you want to delete and click on",
    "8daa8773b2302f41": "Remove GPX files",
    "213b304ea8746a46": "Finally, click on",
    "48f41e682fc7de48": "Choose whether you want to delete track points and/or waypoints, inside or outside of the selection.",
    "dfff2fc7646fcfdb": "Select an area containing the track points and/or waypoints you want to keep or delete.",
    "20bd64eac0e6539c": "Remove all track points and/or waypoints inside/outside an area",
    "97ce8cf3f3991294": "Use the slider to choose the number of track points to keep. You can see a live preview of the GPX file with the reduced number of points.",
    "d68925c9fb49dc29": "Reduce the number of track points of a GPX file",
    "9b87d67013dc7dad": "Track points if you do not want to remove track points at the same time. Then, choose whether you want to delete waypoints inside or outside of the selection. Finally, click on",
    "eadf5b51376c102f": "and select an area containing the waypoints you want to keep or delete. Uncheck the box",
    "a25898b5c4334beb": "To remove all waypoints inside or outside an area, click on",
    "36f50717aae0d4b1": "inside the popup.",
    "eea32454ea4285c8": "gpx.studio — about",
    "e4798bb970d985ff": "Outside selection",
    "a6128306e83c34a5": "Inside selection",
    "f880d2cc949d3835": "Waypoints",
    "5980a24f1557c083": "Choose what to delete",
    "ffd3be0e75ac58a7": "Number of track points:",
    "bbab538b048fc8ce": "Choose the amount of detail to keep",
    "91dd70e03a0186ee": "Proceed",
    "e999cafea164d953": "Keep cropped parts in new files",
    "5aa51317630f43e": "Merge as track segments",
    "e6266174ca9cd359": "Click on another tab to merge the traces",
    "b1a61dc7887d2570": "Copy embedding code",
    "af73e01684863d58": "Copy link",
    "3d3ba460d4fe38f4": "Done!",
    "2c333e7409add292": "(or drag and drop anywhere in the window)",
    "fdc99bc9c4c647d6": "Desktop",
    "3ee545c98f718678": "Choose files from",
    "64cc011881871b0c": "Cancel",
    "88ab52396880cff7": "Ok",
    "b0779a6b729cc621": "Pick a new color",
    "c7e71e772e03b64f": "Got it",
    "becd1770df54fd1f": "and retry.",
    "ff5bd08ca8603b58": "Please log in to the",
    "b898c17e87069946": "This will delete the current trace.",
    "688dc8d2493788dc": "Yes",
    "8834f5786fd5c26f": "Do you wish to continue?",
    "f71cb92d49f40a7f": "This will delete all open traces.",
    "7c9d1361f3a03297": "Save to Google Drive",
    "523adea09175d3c": "Help keep the website free",
    "72cb8de3e29cc194": "Each map display, track point added or moved is billed.",
    "36ad27515e954f09": "Cadence",
    "b7800c792b3a19b0": "Heartrate",
    "93f77e2fe51c80f2": "Temperature",
    "98dbb1ecd89efb45": "Time",
    "2be655456da1726c": "Merge all traces",
    "7398185d92b5537b": "Export settings",
    "ff04f476db79c859": "Delete the trace",
    "9702170e5a0c1a57": "Delete track points and/or waypoints inside/outside rectangle selection",
    "1dffb230813db24d": "Reduce the number of track points",
    "8a1e3eb8e4c9cec7": "Add a waypoint (drag to change its location and use the buttons to edit info, duplicate or remove)",
    "71a5f1587ff29599": "Change the display color, this color will be exported and detected when re-imported",
    "361e6899aaef214a": "Duplicate the trace",
    "d8a787cd2062e4c1": "Extract all track segments and creates one trace for each",
    "34288961ce1348ef": "Merge with another trace (automatically extends time, heart rate, cadence and temperature data)",
    "8dfc39ea00100e13": "Reverse the trace and adapt the timestamps",
    "acabc76374ae112a": "Change the speed and starting time of the trace",
    "b6c6205b70ff871d": "Enter edition mode to add, move, insert (by dragging the line), delete or split (right-click) track points",
    "c0084e8403e254be": "The menu on the left contains all the editing tools described below.",
    "4c37f58ea3290c3b": "Show or hide the elevation profile",
    "5b459771427f50b": "Ctrl+H",
    "cd8997d4554a6fa8": "Change units displayed",
    "9adb4eeced335f82": "F4",
    "54be145ab22ac026": "mi",
    "9647c8eda989cfec": "Switch between cycling, running and driving mode (impacts the routing and the Strava Heatmap displayed)",
    "7829bdae42c0c67a": "F3",
    "38ea63fdeb767680": "F2",
    "3d4e7497cb33745f": "Show or hide the Strava Heatmap",
    "f62bb3d36747837b": "F1",
    "1a6172696d0eb808": "with the maps available and some settings.",
    "78056be089b86a60": ", you can find a dropdown menu",
    "99513e8278e4c9b7": "and the Google Street View tool",
    "838e7cf6b9533787": "Below the search bar",
    "491b3dcd20d567b6": "Exit current menu or tool",
    "6b4c2fca03cdf6fe": "Escape",
    "40f0700e3a55ab2a": "Delete all traces",
    "89e569b2f95eb3de": "Ctrl+K",
    "86f8d256068a8b47": "Undo and redo actions in edition mode",
    "fb3d0aae8e38a23f": "Ctrl+Z/Y",
    "fcc784c4eb098e3e": "Ctrl+S",
    "83a83cc103790ae9": "Start drawing a new route by placing track points on the map",
    "9da36df0eeeb308f": "Ctrl+D",
    "837a585f006d0389": "Import and visualize GPX files (or drag and drop anywhere in the window)",
    "9e739a3b998e610b": "Ctrl+O",
    "4e94bad23caee850": "Elevation profile",
    "b6adfb5428d4252e": "Distance markers",
    "e5a05dc2a96bf2db": "Chevrons",
    "bcc566d058525d31": "Routing",
    "df3418cc3c498e89": " mi",
    "fe9017c3a9132588": "To remove a single waypoint, click on it and press",
    "a6669563844ad034": "Remove waypoints of a GPX file",
    "61db8c48a329ffe3": "inside the popup. Change the information and then click",
    "3e5db95c29e10e26": "To edit the data of a waypoint, click on it and press",
    "c087f2bfa647a5f8": "To change the location of a waypoint, you can simply drag it to a new location. When dragging a waypoint close to the trace, it is automatically attracted so that you can place the waypoint perfectly on the trace. Zoom in or out to change the distance at which the waypoints are attracted.",
    "46c06f832af74208": "Edit a waypoint of a GPX file",
    "914e3ea6ab19691a": "inside the popup. Then, click on the map to add a copy of the waypoint at the chosen location.",
    "9fa77132b9c6e211": "If you want to reuse a waypoint at another location, click on the waypoint and press",
    "508da69a722eb48f": "Fill in some data about the waypoint (you can use HTML to format information, or even link images).",
    "f131fd1929e2128f": "Click on the map at the location you want to place it.",
    "dabec836137e3602": "Add waypoints (points of interest) to a GPX file",
    "26162f8fa438b1ef": "Click on the color to open the color picker.",
    "add3c6d72969667f": "Change the color of a GPX file",
    "ee9a2b183d738cc7": "to duplicate a GPX file.",
    "4a100736a04e7694": "Copy a GPX file",
    "589a7ed854eb65d": "(available only if the file has more than one track segment). If the GPX file contains waypoints (points of interest), they are kept in the files for which the traces pass closest.",
    "bdaab6f7cd0d3a8d": "Extract track segments of a GPX file",
    "f029de17474eb577": "When merging multiple GPX files: missing time, temperature, heartrate or cadence data will be automatically extended with the average value across merged files.\n                    If some GPX files contains timestamps, it is ensured that the timestamps of the merged file are strictly increasing (the timestamps of some files are shifted if necessary).",
    "a10142fc2607123c": "Merge all traces.",
    "f0dc19a1f824f962": "Check the box",
    "edb4ad4e3840f8b6": "Below the bottom panel, put the tabs in the order you want them to appear in the merged GPX file.",
    "f7f4e058c48803be": "If you want to merge all open GPX files at once:",
    "b757fec6509a594f": "Click on the tab of the second GPX file to merge. The track points of the second GPX file will come after those of the first GPX file.",
    "d993eda5038b6ad9": "(available only when more than two files are open).",
    "dcbcd7d41723c70b": "Below the bottom panel, select the tab of the first GPX file you want to merge.",
    "888992b1c320b9f3": "To merge two GPX files:",
    "5fd767754341c6a0": "Merge multiple GPX files",
    "c58f141a0243b76c": "Change the average speed.",
    "ae463fc12a03634d": "Change the speed of a GPX file",
    "8527ab3ce8ad591f": "Change the start time.",
    "580ee74c3544acfb": "Change the date of a GPX file",
    "79c952f4e81ea687": "If the GPX file already has timestamps, they will be shifted and compressed to match the chosen speed and start time.",
    "1d2f65b6fef531ef": "Experimental to generate timestamps which make the speed vary depending on the slope.",
    "1d7acfffdcb512fe": "If the GPX file has no timestamps, a constant speed is applied to the whole GPX file by default. You can check the box",
    "4d31c6d436fc452b": "Select the start time.",
    "67817586b860ef9f": "Enter the average speed.",
    "a846daac1af57dfb": "Add timestamps to a GPX file",
    "c8ebedddcc7f9788": "Keep cropped parts in new files and then click on",
    "d929c09ef51fb197": "to validate the selection. Check the box",
    "3a2da7f6650ef94f": "Split a GPX file",
    "142543d225a1061c": "Waypoints if you do not want to remove waypoints at the same time. Then, choose whether you want to delete track points inside or outside of the selection. Finally, click on",
    "29c2e6656bd4559c": "and select an area containing the track points you want to keep or delete. Uncheck the box",
    "b6e5c9b311e1ebfa": "Then, right-click on a track point or on the line to split the trace at a chosen location.",
    "ea3dc81774eb4a3a": "Enter the edition mode by clicking on",
    "a92105496cdf0531": "to validate the selection. You can choose whether you want to keep cropped parts in separate files.",
    "7569ed2ba74ff461": "Use the slider in the bottom panel to move the start and end points of the trace. Click on",
    "d60a79fb21743ce2": "There are three options:",
    "7b9fb2057b36b91e": "Crop a GPX file",
    "f233c46eece81a9e": "If you edit a GPX file containing time, temperature, heartrate or cadence data, new track points will automatically contain the average value for each of those fields.",
    "dcfbefb7c3837057": "buttons.",
    "ef297354cd523a66": "If you make a mistake or change your mind about the itinerary, use the undo",
    "1f166ecde032523e": "right-click on a track point or on the line to split the trace at a chosen location.",
    "26f223ea0228083a": "drag a point or the line itself to re-route the trace through a new location.",
    "d95035d52f8c7f44": "add track points at the end of the trace by clicking on the map at the locations you want to go through.",
    "cb5a69a9be72338c": "to enter the edition mode. You can then:",
    "8aec93d0a3eb8a09": "Edit the track points of a GPX file",
    "6d1f0b069e845043": "to open GPX files stored on your Google Drive, you can install the",
    "e4660d348ff05331": "If you want to use",
    "bc0bd92d8af87121": "and send it to your friends!",
    "74314db87eed5ee2": "When the files are uploaded, click on",
    "2a1f4b6b14798329": "Select the folder where you want to save the files.",
    "fd1571519046a14a": "Connect to your Google account.",
    "3a306e6bcc4c06e5": "does not provide GPX file hosting. However, it integrates smoothly with Google Drive.\n                    To share GPX files:",
    "fca40e0849de080": "Share a GPX file",
    "2a5ad51ae13fd54c": "Drag and drop a tab (below the bottom panel) onto your desktop.",
    "70c6da8c3bb9a9c6": "to save it in the cloud.",
    "e735a11fc1f60c24": "to download the files on your computer or on",
    "e5d4a55c4b6f9e62": "Then, click on",
    "52d72f50c24c6d3": "include time, temperature, heartrate and cadence data or not.",
    "a8274c4175063bed": "merge all open GPX files or export them separately.",
    "f03044d323517916": "and then choose whether to:",
    "27c196e5cf632594": "Export GPX files",
    "8fb41178c82095e7": "Drag and drop GPX files in the window.",
    "d27a4d4ebd00d780": "and select one or more GPX files to load.",
    "7ae8cf5ef2de87cd": "Load",
    "ba54ab8f40d34f5f": "Click on",
    "2af2fb72c985fb63": "There are two options:",
    "19bde48b0a109d32": "Load existing GPX files",
    "cb8ccbda2c83ac70": "right-click on a track point to remove it.",
    "c0d00e128bc4f99f": "buttons",
    "9a44bf0afd4231c1": "and redo",
    "3c4e2a3e59f6c1b2": "use the undo",
    "18e778783dd3f841": "If you make a mistake or change your mind about the itinerary, you can:",
    "cb4d34b39f9ea0be": "You can drag a point or the line itself to re-route the trace through a new location.",
    "8c0084f938da4135": "to alternate between routing (following real paths) or \"as-the-crow-flies\" (straight lines between track points).",
    "7aeebb9dea1e0a41": "to select the correct activity and use the most appropriate roads.",
    "a19f468d3caa8379": "use",
    "c65ab7f24f71b757": "two options control how two consecutive points are connected:",
    "9e8c1505f53c5751": "In the settings",
    "84f899edc45ef90f": "Place track points on the map by clicking at the locations you want to go through.",
    "542cd0d43d589692": "appears below the bottom panel.",
    "7338344483a0eae0": "A new tab called",
    "501afcedfc8c7d0a": "In the top toolbar, click on",
    "2dfee86899efe0db": "Create a new GPX file",
    "328a1af499b023a6": "Click on a topic to learn more!",
    "1213a93af010076c": "Thanks for your support!",
    "23dc5695d24351b2": "ad-free",
    "21b20cba91bc7297": "and",
    "6921ee02aa85090e": "free to use",
    "9273b7badf13ac8f": "So if you like the tool and use it frequently, please consider making even a small donation so that this website can stay",
    "74d5d08717b2ebc0": "above). Other billable operations include map loads and geocoding requests (looking for a place in the search bar).",
    "2d5d99633fc695d": "Unfortunately this is not free even with Mapbox's support (see",
    "4d3a9cb5d486cfdd": "to add precise elevation data to the new track points.",
    "3446383bc93343e4": "to retrieve a route on the road network. In addition, we request",
    "cd54c2312a398e55": "Each time you add or move a track point, we make a request to",
    "a650b37220124fce": "Help keep the website free (and ad-free)",
    "fbc94da0daae2fb1": "I am (and all users of the website can be) very grateful for their support and availability.",
    "83b64adb0e6210eb": "to have joined this program and to benefit from a great discount on all API rates. Thanks to them, funding this project only through donations should be sustainable in the long term.",
    "d6e8f9bbc9979e8e": "very lucky",
    "22689bc7d3ba73c7": "where they showcase some of their collaborations). We are",
    "a36cf9897dec2210": " official page",
    "3d7c64aa44c8c569": "to support non-profits, educational institutions, and positive-impact organizations (see the",
    "89090cb80003912c": "They created a program called",
    "aedb99c00c521211": "is the company providing some of the beautiful maps on this website. We also rely on their services to retrieve routes between points you add or move, to add precise elevation data to the traces and to take you to the right location when you type in the search bar.",
    "7a4b735007dc490c": "Mapbox Community",
    "a20d726d793e8915": "to be notified about updates of the tool.",
    "237ca2cb15751b87": "Follow us on",
    "b2b991d9bed644f1": "It is a one-person side project created after messing with GPX files for some time. The project source code is publicly available on",
    "24b058e14016bcb9": "save the result on your computer or to your Google Drive™ to get a shareable link and embedding code",
    "3f1ec6e8458290aa": "extract segments from traces and perform any other action while maintaining the segments' structure within files",
    "9af1c4c059f3239b": "merge multiple traces, extending time, heart rate, cadence and temperature data where needed",
    "752de0024ce52fd5": "automatically add elevation data to traces if missing",
    "5560ac7f9a13c91f": "reduce the number of track points",
    "55ddb3af01517edb": "view, add, edit and remove waypoints",
    "a02d04dae0210f98": "add timestamps to a trace",
    "c12054dabe15f76f": "reverse traces",
    "e9c6c55a05d1cdf0": "edit traces by adding, inserting, moving or deleting track points",
    "4d54177be4ba66be": "is a free online GPX viewer and editor which allows to:",
    "a86c7c7924b9cd37": "Legal",
    "ec95a06f45b89413": "Support",
    "e86b2b1b268a8161": "Embedding",
    "806eaac9d78d1fdc": "User Guide",
    "6b40baf401d30dd": "Funding",
    "3f67d4dc29f0dc4d": "km ",
    "5966da96b39aab73": "Units",
    "a2262295e8c670bd": "Activity",
    "9ead0042f55dfc67": "Total",
    "347c5ea4de70e650": "Segments",
    "963f5638fb8f224": "Track points",
    "93b436eef8ef4e61": "Moving time",
    "ee951978afc1e79c": "km/h",
    "6c7522b6a5d3e69": "Speed",
    "4a993ab905a20f6b": "m",
    "8dbf2a79f20d963d": "Elevation gain",
    "dd3cb463864b4145": "km",
    "e94fdd9ca7be5249": "Distance",
    "fa0b00bbfa206744": "Donate",
    "8a48b7b41568a4d": "About",
    "c9739011408f4ca0": "Help",
    "9d00dcd7d4c4d902": "Clear all",
    "b2ddb24307b8021e": "Export",
    "c79f9c362fa54220": "Draw",
    "81d04d1b40d56429": "Load GPX",
    "321d3a92d2cda216": "gpx.studio — the online GPX file editor"
}
